FileUploading/wwwroot/files/IT1_Candidate.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://inthr2.luxoft.com/integration" xmlns:int1="http://inthr2.luxoft.com">
   <soapenv:Header/>
   <soapenv:Body>
      <int:SaveHrSysCandidate>
         <!--Optional:-->
         <int:candidateRequestDTO>
            <!--Optional:-->
            <int:ApprovalDate>2021-04-09</int:ApprovalDate>
            <!--Optional:-->
            <int:Comment></int:Comment>
            <!--Optional:-->
            <int:DepartmentId>B04DBE1F-987B-4FD2-9276-AC5D00A832C6</int:DepartmentId>
            <!--Optional:-->
            <int:Email>testerAAAAB@test.it</int:Email>
            <!--Optional:-->
            <int:FinancialBusinessUnit>
               <!--Optional:-->
               <int1:Id>880ACD69-4AAE-42A1-A336-8C0447C48B89</int1:Id>
            </int:FinancialBusinessUnit>
            <!--Optional:-->
            <int:FirstNameEnglish>FirstNameEnglishAAAAB</int:FirstNameEnglish>
            <!--Optional:-->
            <int:FirstNameNative>FirstNameNativeAAAAB</int:FirstNameNative>
            <!--Optional:-->
            <int:HireDate>2021-04-09</int:HireDate>
            <!--Optional:-->
            <int:HiringManager>omsk\SGubarenko</int:HiringManager>
            <int:JiraId>TestJiraId-AAAAB</int:JiraId>
            <!--Optional:-->
            <int:LastNameEnglish>LastNameEnglishAAAAB</int:LastNameEnglish>
            <!--Optional:-->
            <int:LastNameNative>LastNameNativeAAAAB</int:LastNameNative>
            <!--Optional:-->
            <int:LocationId>F128E966-FC9A-486B-BA18-9AE0010744EF</int:LocationId>
            <!--Optional:-->
            <int:MiddleNameNative>MiddleNameNativeAAAAB</int:MiddleNameNative>
            <!--Optional:-->
            <int:NationalityCode>RU</int:NationalityCode>
            <!--Optional:-->
            <int:OfferApprover>SPB\ISBashlakov</int:OfferApprover>
            <!--Optional:-->
            <int:PositionId>A0EABBDB-D19D-4760-9DF7-36EF7E4CD8BA</int:PositionId>
            <!--Optional:-->
            <int:ProbationaryPeriodDuration>3</int:ProbationaryPeriodDuration>
            <!--Optional:-->
            <int:RecommendationDate>2021-04-09</int:RecommendationDate>
            <!--Optional:-->
            <int:Recommender></int:Recommender>
            <!--Optional:-->
            <int:Recruiter>SPB\SKushevskiy</int:Recruiter>
            <!--Optional:-->
            <int:RegistrationTypeId>E5C8DBA6-E462-4A69-AFD8-770420FF9111</int:RegistrationTypeId>
            <!--Optional:-->
            <int:RelocatedFrom>Russia</int:RelocatedFrom>
            <!--Optional:-->
            <int:RoleDegreeId>48F4A0D6-C92C-4AE7-924F-A63500AD73CE</int:RoleDegreeId>
            <!--Optional:-->
            <int:RoleId>F4681696-F24E-488B-9992-51280BBEA409</int:RoleId>
            <!--Optional:-->
            <int:SappCurrencyCode>RUB</int:SappCurrencyCode>
            <!--Optional:-->
            <int:SappGrossNet>GROSS</int:SappGrossNet>
            <!--Optional:-->
            <int:SappRegularBonusAccrualPeriod>Monthly</int:SappRegularBonusAccrualPeriod>
            <!--Optional:-->
            <int:SappRegularBonusType>Amount</int:SappRegularBonusType>
            <!--Optional:-->
            <int:SappRegularBonusValue>11000</int:SappRegularBonusValue>
            <!--Optional:-->
            <int:SappSalary>65000</int:SappSalary>
            <!--Optional:-->
            <int:SappSalaryPaymentPeriodId>Per Month</int:SappSalaryPaymentPeriodId>
            <!--Optional:-->
            <int:SoppCurrencyCode>RUB</int:SoppCurrencyCode>
            <!--Optional:-->
            <int:SoppGrossNet>GROSS</int:SoppGrossNet>
            <!--Optional:-->
            <int:SoppRegularBonusAccrualPeriod>Monthly</int:SoppRegularBonusAccrualPeriod>
            <!--Optional:-->
            <int:SoppRegularBonusType>Amount</int:SoppRegularBonusType>
            <!--Optional:-->
            <int:SoppRegularBonusValue>7000</int:SoppRegularBonusValue>
            <!--Optional:-->
            <int:SoppSalary>45000</int:SoppSalary>
            <!--Optional:-->
            <int:SoppSalaryPaymentPeriodId>Per Month</int:SoppSalaryPaymentPeriodId>
            <!--Optional:-->
            <int:Specialization>
               <!--Optional:-->
               <int1:Id>16BECFC0-E046-49D3-A3ED-6D68E2DCFFAE</int1:Id>
            </int:Specialization>
			
            <!--Optional:<int:Status></int:Status>-->
            
            <!--Optional:-->
            <int:WorkplaceType>
               <!--Optional:-->
               <int1:Id>C75A33DF-F3FB-4094-8985-65A94A547A2D</int1:Id>
            </int:WorkplaceType>
         </int:candidateRequestDTO>
      </int:SaveHrSysCandidate>
   </soapenv:Body>
</soapenv:Envelope>